// Напишите программу, которая на вход принимает число и выдаёт его квадрат 
//(число умноженное на само себя).
// переменная записывается так:
// тип_данных имя_переменной = значение_переменной
Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
int b = a * a;
Console.WriteLine(b);

